{
  "format": "layers-model",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "ToxiSimModel",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 8,
            "activation": "relu",
            "input_shape": [3]
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "sigmoid"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [3, 8],
          "dtype": "float32",
          "quantization": {
            "scale": 0.02,
            "min": -0.5
          }
        }
      ]
    }
  ]
}
